app/views/comments/_comment.html.erb

		<small>
			By <%= comment.user.email %> at <%= comment.created_at.to_date %>
---
INSERT INTO "comments" ("content", "user_id", "parent_id", "parent_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "hello"], ["user_id", 1], ["parent_id", 27], ["parent_type", "Post"], ["created_at", "2018-03-15 17:38:43.818926"], ["updated_at", "2018-03-15 17:38:43.818926"]]