app/views/likes/toggle.js.erb

  var count = <%= Like.where(parent_id: params[:parent_id], parent_type: params[:parent_type]).length %>;
---
SELECT "likes".* FROM "likes" WHERE "likes"."parent_id" = ? AND "likes"."parent_type" = ?  [["parent_id", 59], ["parent_type", "Post"]]