app/views/posts/_post.html.erb

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "first post"], ["user_id", 1], ["created_at", "2018-03-15 17:31:32.682103"], ["updated_at", "2018-03-15 17:31:32.682103"]]
---
			By <%= post.user.email %>
			at <%= post.created_at.to_date %>