app/views/posts/index.html.erb

SELECT "posts".* FROM "posts"
---

		<% Post.all.reverse.each do |p| %>