app/controllers/comments_controller.rb

	def create

		if( params[:comment][:parent_type]=='Post')
			@parent=Post.find(params[:comment][:parent_id])
		else
			@parent = Comment.find(params[:comment][:parent_id])
		end

		@comment = Comment.create(
                   content: params[:comment][:content],
                   user_id: current_user.id,
                   parent: @parent
			       )
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 0]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 27]]
INSERT INTO "comments" ("content", "user_id", "parent_id", "parent_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "hello"], ["user_id", 1], ["parent_id", 27], ["parent_type", "Post"], ["created_at", "2018-03-15 17:38:43.818926"], ["updated_at", "2018-03-15 17:38:43.818926"]]

	def destroy
    @comment= Comment.find(params[:id])
  	#post_id = @comment.post_id
  	@comment.comments.destroy_all
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 33]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 33]]