app/controllers/likes_controller.rb

	def toggle

		like = Like.find_by(
			parent_type: params[:parent_type],
			parent_id: params[:parent_id],
			user: current_user
			)

		if like.blank?
			like = Like.create(
					parent_type: params[:parent_type],
					parent_id: params[:parent_id],
					user: current_user
				)
			@liked = true

		else

			like.destroy
---
SELECT  "likes".* FROM "likes" WHERE "likes"."parent_type" = ? AND "likes"."parent_id" = ? AND "likes"."user_id" IS NULL LIMIT 1  [["parent_type", "Post"], ["parent_id", 59]]
INSERT INTO "likes" ("parent_type", "parent_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["parent_type", "Post"], ["parent_id", 58], ["user_id", 1], ["created_at", "2018-03-31 20:14:54.497061"], ["updated_at", "2018-03-31 20:14:54.497061"]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]