app/controllers/posts_controller.rb

	def create

		@post = Post.create(

                content: params[:post][:content],
                user_id: current_user.id
                )
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "first post"], ["user_id", 1], ["created_at", "2018-03-15 17:22:14.408698"], ["updated_at", "2018-03-15 17:22:14.408698"]]

	def update
		@post=Post.find(params[:id])
		@post.update(
          content: params[:post][:content]
           )
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 45]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "Hello"], ["updated_at", "2018-03-18 09:31:40.201715"], ["id", 48]]

	def destroy
		@post= Post.find(params[:id])
		if @post.user_id != current_user.id
        redirect_to action: "index"
    else
		@post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 31]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 31]]