app/controllers/users_controller.rb

UPDATE "users" SET "avatar_updated_at" = ?, "avatar_file_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["avatar_updated_at", "2018-03-18 11:23:18.692365"], ["avatar_file_name", "glogo.png"], ["updated_at", "2018-03-18 11:23:18.936661"], ["id", 1]]
---
	def update
		current_user.update(
			email: params[:user][:email],
			avatar: params[:user][:avatar]

			)